Zalmotek/zalmotek-RA6M1-feather/firmware/Digital/Ra6M1_Feather_Digital_Blink/src/hal_entry.cpp
#include "hal_data.h"
#include "common_utils.h"

FSP_CPP_HEADER
void R_BSP_WarmStart(bsp_warm_start_event_t event);
FSP_CPP_FOOTER

void delay(int t);
void delay(int t) {
    R_BSP_SoftwareDelay(t, BSP_DELAY_UNITS_MILLISECONDS);
}

/*******************************************************************************************************************//**
 * main() is generated by the RA Configuration editor and is used to generate threads if an RTOS is used.  This function
 * is called by main() when no RTOS is used.
 **********************************************************************************************************************/
void hal_entry(void)
{
    R_BSP_PinAccessEnable();

    /* Array of pins to control */
    const bsp_io_port_pin_t pins[] = {
        BSP_IO_PORT_02_PIN_07, // D5
        BSP_IO_PORT_02_PIN_06, // D6
        BSP_IO_PORT_02_PIN_05, // D9
        BSP_IO_PORT_02_PIN_10, // D10
        BSP_IO_PORT_02_PIN_00, // D11
        BSP_IO_PORT_03_PIN_02, // D12
        BSP_IO_PORT_03_PIN_01  // D13
    };

    const size_t pin_count = sizeof(pins) / sizeof(pins[0]);

    while (true)
    {
        for (size_t i = 0; i < pin_count; ++i)
        {
            /* Set pin LOW */
            R_BSP_PinWrite(pins[i], BSP_IO_LEVEL_LOW);
            APP_PRINT("Pin %u LOW\n", i);
            delay(50);

            /* Set pin HIGH */
            R_BSP_PinWrite(pins[i], BSP_IO_LEVEL_HIGH);
            APP_PRINT("Pin %u HIGH\n", i);
            delay(50);
        }
    }

#if BSP_TZ_SECURE_BUILD
    /* Enter non-secure code */
    R_BSP_NonSecureEnter();
#endif
}

/*******************************************************************************************************************//**
 * This function is called at various points during the startup process.  This implementation uses the event that is
 * called right before main() to set up the pins.
 *
 * @param[in]  event    Where at in the start up process the code is currently at
 **********************************************************************************************************************/
void R_BSP_WarmStart(bsp_warm_start_event_t event)
{
    if (BSP_WARM_START_RESET == event)
    {
#if BSP_FEATURE_FLASH_LP_VERSION != 0

        /* Enable reading from data flash. */
        R_FACI_LP->DFLCTL = 1U;

        /* Would normally have to wait tDSTOP(6us) for data flash recovery. Placing the enable here, before clock and
         * C runtime initialization, should negate the need for a delay since the initialization will typically take more than 6us. */
#endif
    }

    if (BSP_WARM_START_POST_C == event)
    {
        /* C runtime environment and system clocks are setup. */

        /* Configure pins. */
        R_IOPORT_Open (&IOPORT_CFG_CTRL, &IOPORT_CFG_NAME);

#if BSP_CFG_SDRAM_ENABLED

        /* Setup SDRAM and initialize it. Must configure pins first. */
        R_BSP_SdramInit(true);
#endif
    }
}

#if BSP_TZ_SECURE_BUILD

FSP_CPP_HEADER
BSP_CMSE_NONSECURE_ENTRY void template_nonsecure_callable ();

/* Trustzone Secure Projects require at least one nonsecure callable function in order to build (Remove this if it is not required to build). */
BSP_CMSE_NONSECURE_ENTRY void template_nonsecure_callable ()
{

}
FSP_CPP_FOOTER

#endif
